const texts = {
    easy: [
        "रात को चाँदनी में बहुत अलग होता है।",
        "मेरे दिल की धड़कन तुम्हारे लिए है।",
        "हम सब मिलकर एक सुंदर समाज बना सकते हैं।",
        "यह एक सुंदर दिन है, हमें इसे खुशी से बिताना चाहिए।",
    ],
    medium: [
        "रात को चाँदनी में बहुत अलग होता है।",
        "मेरे दिल की धड़कन तुम्हारे लिए है।",
        "हम सब मिलकर एक सुंदर समाज बना सकते हैं।",
        "यह एक सुंदर दिन है, हमें इसे खुशी से बिताना चाहिए।",
    ],
    hard: [
        "रात को चाँदनी में बहुत अलग होता है।",
        "मेरे दिल की धड़कन तुम्हारे लिए है।",
        "हम सब मिलकर एक सुंदर समाज बना सकते हैं।",
        "यह एक सुंदर दिन है, हमें इसे खुशी से बिताना चाहिए।",
    ],
  };
  export default texts;
  